const emojiMap: Record<string, string> = {
  '0': '0️⃣',
  '1': '1️⃣',
  '2': '2️⃣',
  '3': '3️⃣',
  '4': '4️⃣',
  '5': '5️⃣',
  '6': '6️⃣',
  '7': '7️⃣',
  '8': '8️⃣',
  '9': '9️⃣',
  a: '🇦',
  b: '🇧',
  c: '🇨',
  d: '🇩',
  e: '🇪',
  f: '🇫',
  g: '🇬',
  h: '🇭',
  i: '🇮',
  j: '🇯',
  k: '🇰',
  l: '🇱',
  m: '🇲',
  n: '🇳',
  o: '🇴',
  p: '🇵',
  q: '🇶',
  r: '🇷',
  s: '🇸',
  t: '🇹',
  u: '🇺',
  v: '🇻',
  w: '🇼',
  x: '🇽',
  y: '🇾',
  z: '🇿',
  '!': '❗',
  '?': '❓',
  '#': '#️⃣',
  '*': '*️⃣',
  '+': '➕',
  '-': '➖',
  '/': '➗',
  '=': '🟰',
  '@': '📧',
  $: '💲',
  '%': '🔢',
  '&': '🔗',
  '(': '🈴',
  ')': '🈵',
  '^': '⬆️',
  _: '➖',
  '[': '🆖',
  ']': '🆗',
  '{': '🈶',
  '}': '🈚',
  '<': '◀️',
  '>': '▶️',
  '|': '🚧',
  '\\': '⛔',
  '~': '〰️',
};

const emojify = (str: string) => {
  return str
    .split('')
    .map((char) => emojiMap[char] ?? char)
    .join('');
};

class EmojiUtils {
  static readonly emojify = emojify;
}

export { EmojiUtils, emojiMap };
